---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModule.GetMacroModuleIterator
source: html/852610f9-f354-fe96-5bfd-a0821ada7fa0.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.GetMacroModuleIterator Method

Returns a Macro module iterator that iterates through the collection.

## Syntax (C#)
```csharp
public MacroModuleIterator GetMacroModuleIterator()
```

## Returns
A Macro module iterator object that can be used to iterate through key-value pairs in the collection.